{
    "dir": "ltr",
    "components": {
        "back_to_home": "На главную",
        "cookie_confirm": {
            "content": "Не волнуйтесь, я использую cookie-файлы для\nпредоставления вам лучшего опыта просмотра.\nКак и любые другие веб-сайты.",
            "button": "Хорошо, закрыть!"
        },
        "theme_switcher": {
            "view_toast": "Переключить цветовую тему"
        },
        "partnership_banner": {
            "heading": "Хотите нанять меня?",
            "content_1": "Для сокращения времени обработки, пожалуйста, напишите мне сообщение.",
            "content_2": "В сообщении обязательно укажите: название и общее описание проекта, техническое задание, ссылку на CJM (если необходимо взаимодействие с пользователем) и желаемые сроки выполнения.",
            "content_3": "Я работаю во временной зоне UTC+03:00. Ваши сообщения будут рассмотрены в рабочие дни, с 11:00 до 18:00.",
            "button_1": "Написать в Telegram",
            "button_2": "Написать на Email",
            "email_subject": "Найм"
        },
        "mobile_nav": {
            "open": "Меню",
            "close": "Закрыть",
            "block_1": {
                "heading": "Эффективное содействие",
                "link_1": "Микросервисы",
                "link_2": "Оценка UX"
            },
            "block_2": {
                "heading": "Связь со мной",
                "link_1": "Написать в Telegram",
                "link_2": "Написать на Email",
                "link_3": "Добавить на LinkedIn",
                "email_subject": "Привет"
            },
            "block_3": {
                "heading": "Ссылки на соцсети",
                "link_1": "GitHub профиль",
                "link_2": "Dribbble портфолио",
                "link_3": "Dev.to блог"
            },
            "block_4": {
                "heading": "Настройки сайта",
                "link_1": "Изменить цветовую тему",
                "link_2": "Switch to English"
            }
        },
        "index": {
            "phone_mockup": {
                "name_you": "Вы",
                "name_you_short": "В",
                "name_vic_shostak": "Вик Шóстак",
                "msg_you_1": "Привет, Вик! Ты можешь мне помочь?",
                "msg_vic_shostak_1": "Приветствую! Конечно.",
                "msg_you_2": "Отлично, у меня есть потрясающая бизнес-идея...",
                "msg_vic_shostak_2": "Я найду время, чтобы довести её до релиза. Отправь мне детали в Telegram!",
                "button": "Отправить"
            }
        }
    },
    "modals": {
        "close": "Закрыть",
        "my_skills": {
            "block_1": {
                "heading": "Мои навыки",
                "content": "За более чем 13 лет успешной работы в ИТ-индустрии мой технологический стек неоднократно менялся, но техническая экспертиза всегда оставалась на высоком уровне."
            },
            "block_2": {
                "heading": "Бэкенд",
                "used_frameworks": "Используемые фреймворки и библиотеки:",
                "go_content": "мой основной язык для реализации проектов различной сложности и функционала (от микросервисов до монолитов). Он отлично справляется с широким спектром задач по разработке высокоэффективных бэкенд-сервисов и не раз доказал это.",
                "python_content": "мой вспомогательный язык, например, для проектов с искусственным интеллектом (ИИ) или в случаях, когда у заказчика нет возможности/желания использовать Go.",
                "n8n_content": "я использую этот продукт для реализации serverless-архитектуры и API-gateway подхода, а также, для создания Telegram-ботов."
            },
            "block_3": {
                "heading": "Базы данных",
                "postgres_content": "моя основная БД для хранения данных. Также, я использую его встроенный функционал LISTEN/NOTIFY и JSONB-поля.",
                "redis_content": "моя основная in-memory БД для кэширования данных и работы с брокерами (например, с Asynq или RabbitMQ).",
                "sqlite_content": "моя вспомогательная БД для простых проектов и статичных веб-сайтов, где использование PostgreSQL не имеет смысла."
            },
            "block_4": {
                "heading": "Фронтенд",
                "vue_content": "мой основной веб-фреймворк. Являюсь давним его поклонником (ещё с версии 2.х), поэтому все SPA/MPA проекты я реализую именно во Vue-экосистеме (Typescript).",
                "tailwind_content": "мой основной CSS-фреймворк для создания пользовательского интерфейса. Очень часто использую его вместе с библиотекой компонентов daisyUI и Nuxt UI.",
                "htmx_content": "я всегда поддерживаю подобные технологии и библиотеки, потому что они позволяют каждому бэкенд-разработчику стать ещё более эффективным и реализовывать фронтенд-логику, не выходя за рамки привычного стека.",
                "static_generators_content": "мои основные движки для создания статических веб-сайтов и публичной документации.",
                "bun_content": "я использую этот современный, невероятно быстрый и обратно-совместимый с Node.js JavaScript-рантайм.",
                "vite_content": "мой основной инструмент для создания и оптимизации сборок фронтенд-части проекта."
            },
            "block_5": {
                "heading": "UX/UI дизайн",
                "figma_content": "мой основной инструмент для UX-прототипирования и создания UI-дизайна веб-сайтов и мобильных приложений.",
                "figjam_content": "мой основной инструмент для составления CJM веб-сайтов и мобильных приложений."
            },
            "block_6": {
                "heading": "Прокси, CI/CD и инструменты для деплоя",
                "proxy_content": "основные прокси/веб серверы, с которыми я работаю.",
                "docker_content": "все мои Go/Python проекты я размещаю в Docker-образах для последующего деплоя их на удаленный сервер или в облачную инфраструктуру в виде изолированных контейнеров.",
                "actions_runners_content": "для автоматизации процесса деплоя и проверки/валидации кодовой базы.",
                "goreleaser_content": "для автоматизации процесса сборки Go-проекта для различных архитектур и ОС, а также, публикации в Homebrew и Docker Hub."
            }
        },
        "work_philosophy": {
            "block_1": {
                "heading": "Философия моей работы",
                "content_1": "Все мои проекты имеют отличную документацию и чистый код.",
                "content_2": "Но я считаю, что важно не просто написать чистый код и создать поддерживаемую инфраструктуру или отличный UI, а искать корень проблемы в поставленной задаче.",
                "content_3": "Такой подход к решению задач позволяет реализовывать сложные программные решения, которые может поддерживать любая команда разработчиков."
            },
            "block_2": {
                "heading": "Рабочий процесс",
                "content": "Вот пример, описывающий мой подход к решению задачи, который даст вам понимание моего рабочего процесса.",
                "schema": {
                    "content_1": "Постановка\nзадачи",
                    "content_2": "Анализ\nтехн. задания/CJM",
                    "content_3": "Проработка\nоптимального решения",
                    "content_4": "Согласование\nплана реализации",
                    "content_5": "Реализация",
                    "content_6": "Подготовка\nтестового стенда",
                    "content_7": "Тестирование\nреализации",
                    "content_8": "Внесение\nправок",
                    "content_9": "Финальное\nтестирование",
                    "content_10": "Документация\nк реализации",
                    "content_11": "Передача\nзаказчику"
                },
                "scroll_to_right": "Прокрутите вправо"
            },
            "block_3": {
                "heading": "Поддержка реализованных проектов",
                "content_1": "Я осуществляю бесплатную поддержку (в рамках изначального технического задания или CJM) всех реализованных микросервисных решений в течении 14 рабочих дней после их передачи заказчику.",
                "content_2": "Более длительный срок оговаривается после истечения срока бесплатной поддержки в индивидуальном порядке."
            },
            "block_4": {
                "heading": "Консультирование",
                "content_1": "Я осуществляю бесплатное консультирование (в рамках изначального технического задания или CJM) по всем созданным аналитическим UX-отчётам в течении 7 рабочих дней после их передачи заказчику.",
                "content_2": "Более длительный срок оговаривается после истечения срока бесплатных консультаций в индивидуальном порядке."
            }
        },
        "timeweb_cloud": {
            "heading": "Что такое Timeweb Cloud?",
            "content_1": "Timeweb Cloud&nbsp;&mdash; это облачная инфраструктура для бизнеса и разработки с 15-ти летнем опытом работы и более чем 165 тыс. клиентов.",
            "content_2": "Основные преимущества:",
            "list": {
                "item_1": "Инфраструктура размещена в отказоустойчивых центрах обработки данных уровня TIER III в России и Европе.",
                "item_2": "Дата-центры имеют коэффициент отказоустойчивости не менее 99,99% и сертификаты PCI DSS, ISO и 152-ФЗ.",
                "item_3": "Есть все необходимые облачные технологии для работы (базы данных, S3-хранилище, Kubernetes, CI/CD и так далее).",
                "item_4": "Круглосуточный мониторинг за доступностью сервисов и мгновенное реагирование на возникающие проблемы.",
                "item_5": "Поддержка 24/7 в течении 1 минуты по телефону и за 15 минут в тикете."
            },
            "from_author": {
                "name": "Вик Шóстак",
                "content": "От себя лично могу выделить такие преимущества Timeweb Cloud, как доступные цены и максимальную клиентоориентированность."
            },
            "button": "Перейти на сайт Timeweb Cloud"
        },
        "craftum": {
            "heading": "Что такое Craftum?",
            "content_1": "Craftum&nbsp;&mdash; это онлайн-конструктор для создания веб-сайтов любой сложности с более чем 150 готовыми шаблонами премиального качества.",
            "content_2": "Основные преимущества:",
            "list_1": {
                "item_1": "Создание веб-сайтов по готовым шаблонам или собственному дизайну.",
                "item_2": "Помощь в переносе вашего веб-сайта с Wix, Tilda, Squarespace и Ecwid.",
                "item_3": "Множество готовых интеграций с другими сервисами (онлайн-чат, системы приёма онлайн-оплаты, аналитика и так далее).",
                "item_4": "Встроенные инструменты для SEO-продвижения.",
                "item_5": "Поддержка 24/7."
            },
            "from_author": {
                "name": "Вик Шóстак",
                "content": "От себя лично могу выделить такие преимущества платформы Craftum, как доступные цены и простота использования."
            },
            "button": "Перейти на сайт Craftum"
        }
    },
    "pages": {
        "index": {
            "left_column": {
                "block_1": {
                    "hello": "Привет,",
                    "author": "Я — Вик Шóстак."
                },
                "block_2": {
                    "heading": "Кто я такой?",
                    "content": "Инженер-программист с отличными знаниями UX/UI и более 13 годами практического опыта в различных технологических областях.",
                    "button": "Мои навыки"
                },
                "block_3": {
                    "heading": "Философия моей работы",
                    "content": "Прежде всего, я разработчик, который знает много о комфортной разработке и поддержке больших проектов на долгосрочной основе.",
                    "button": "Подробнее"
                }
            },
            "middle_column": {
                "block_1": {
                    "heading": "Эффективное содействие",
                    "content": "Я готов поделиться своим опытом для решения ваших бизнес-задач."
                },
                "block_2": {
                    "heading_1": "Микросервисы",
                    "link_1": "Микросервисы позволяют вашему бизнесу принимать все больше и больше заказов",
                    "heading_2": "Оценка UX",
                    "link_2": "Каждый успешный бизнес имеет максимально эффективные веб или мобильные приложения"
                },
                "block_3": {
                    "heading": "Мои проекты",
                    "content": "Еще одна моя страсть — создание полезных инструментов с открытым исходным кодом для разработчиков и бизнеса по всему миру."
                },
                "block_4": {
                    "content": "Да, я всегда ищу новых соавторов для создания превосходных продуктов и сервисов. Если у вас есть идея для проекта с открытым исходным кодом, то свяжитесь со мной!",
                    "button": "Написать сообщение",
                    "email_subject": "Сотрудничество"
                },
                "block_5": {
                    "content": "CLI-инструмент нового поколения для создания веб-приложений",
                    "view_gowebly": "Посмотреть веб-сайт Gowebly"
                },
                "block_6": {
                    "content": "Умный self-hosted инструмент для обмена секретами с друзьями",
                    "view_secretium": "Посмотреть веб-сайт Secretium"
                },
                "block_7": {
                    "content": "Готовый Go-проект с фронтендом и автоматизацией деплоя",
                    "view_cgapp": "Посмотреть репозиторий Create Go App"
                }
            },
            "right_column": {
                "block_1": {
                    "view_github": "Посмотреть мой GitHub профиль",
                    "view_dribbble": "Посмотреть моё Dribbble портфолио",
                    "view_dev_to": "Посмотреть мой Dev.to блог",
                    "view_linkedin": "Посмотреть мой LinkedIn профиль"
                },
                "block_2": {
                    "heading": "I speak English",
                    "content": "The main languages for text communication with me are English and Russian.",
                    "button": "Switch to English"
                },
                "block_3": {
                    "author": "Вик Шóстак",
                    "content": "Все права защищены. Иллюстрации и текст, представленные на этом веб-сайте, являются интеллектуальной собственностью Вика Шóстака и были созданы с&nbsp;&#10084; к людям и роботам.",
                    "link": "Информация об оказании услуг"
                }
            }
        },
        "microservices": {
            "heading": "Микросервисы",
            "sub_heading": "для вашего бизнеса",
            "block_1": {
                "heading": "Что я предлагаю?",
                "content_1": "Я предлагаю сотрудничество полного цикла по созданию масштабируемых, поддерживаемых и отказоустойчивых микросервисов для вашего бизнеса на Go или Python.",
                "content_2": "Микросервисы являются атомарными единицами, они не зависят от выбранного технологического стека вашей команды разработки, используемого в других частях вашего бизнес-процесса.",
                "content_3": "В качестве межпрограммного взаимодействия (IPC) будут использованы gRPC или REST (в формате JSON), что позволит значительно облегчить процесс интеграции нового сервиса в вашу текущую инфраструктуру."
            },
            "block_2": {
                "heading_1": "Масштабируемость и гибкость",
                "content_1": "Микросервисы предлагают уникальную возможность начать с малого и масштабироваться по мере роста. Каждый сервис может быть развернут независимо, что позволяет увеличивать ресурсы для наиболее нагруженных частей системы, не затрагивая остальные.",
                "heading_2": "Ускорение процесса разработки",
                "content_2": "Микросервисы могут быть разработаны и развернуты автономно, что ускоряет процесс внесения изменений и обновлений. Это делает их идеальным решением для любого бизнеса, который нуждается в постоянном обновлении своих систем без простоев.",
                "heading_3": "Беспрерывная работа",
                "content_3": "Микросервисная архитектура повышает устойчивость системы к отказам: если один сервис выходит из строя, он не влияет на работу остальных и наоборот."
            },
            "block_3": {
                "heading": "Примеры задач",
                "content": "Список некоторых реализованных мной ранее задач, где применение микросервисной архитектуры позволило улучшить бизнес-метрики заказчика.",
                "flowchart": {
                    "action": "Событие",
                    "client": "Клиент",
                    "microservice": "Микросервис",
                    "api": "Внешний API",
                    "db": "База данных",
                    "payment": "Платёжный терминал",
                    "crm": "CRM-система",
                    "bi": "BI-аналитика",
                    "report": "Отчёт"
                },
                "card_1": {
                    "heading": "Обработка входящих запросов (API-шлюз)",
                    "content": "Сервис, который интегрируется с различными внешними/внутренними системами компании, обрабатывает запросы клиента и возвращает результат в установленном формате."
                },
                "card_2": {
                    "heading": "Система рекомендаций и уведомлений",
                    "content": "Система, отправляющая персонализированные рекомендации и уведомления о событиях клиентам на основании накопленных данных компании и других внутренних метрик отдела продаж."
                },
                "card_3": {
                    "heading": "Система для сбора статистики и аналитики",
                    "content": "Система для сбора данных о пользовательских взаимодействиях (на веб-сайте или в мобильном приложении) и их анализа с целью получения бизнес-инсайтов."
                }
            },
            "block_4": {
                "heading": "Стоимость услуги",
                "content_1": "Микросервисное решение всегда уникально для каждого бизнеса.",
                "content_2": "В таблице ниже приведены примерные сроки реализации и минимальный расчёт бюджета от которого вы можете отталкиваться. Более точные данные я смогу озвучить после ознакомления с техническим заданием или CJM.",
                "table": {
                    "heading_1": "Наименование услуги",
                    "heading_2": "Срок реализации",
                    "heading_3": "Стоимость",
                    "time_from": "от",
                    "work_days": "раб.&nbsp;дней",
                    "row_1": {
                        "column_1": "Одиночный микросервис-функция по вашим требованиям для решения задач в текущей инфраструктуре"
                    },
                    "row_2": {
                        "column_1": "Полный цикл планирования и разработки микросервисной бэкенд-системы по вашим требованиям с нуля"
                    }
                }
            },
            "block_5": {
                "heading": "Что ещё входит в стоимость?",
                "content": "В стоимость услуги, кроме разработки микросервисного решения, всегда входят следующие работы:",
                "list": {
                    "item_1": "Подготовка тестового стенда для проведения совместного тестирования реализации.",
                    "item_2": "Подготовка Docker-контейнеров для развёртывания в вашей инфраструктуре.",
                    "item_3": "Исчерпывающее руководство по эксплуатации (в формате Markdown или PDF).",
                    "item_4": "Консультации и поддержка в течении 14 рабочих дней (в рамках изначального технического задания или CJM).",
                    "item_5": "Отправка пакета закрывающих документов для бухгалтерии."
                }
            },
            "block_6": {
                "heading": "Нет собственной инфраструктуры?",
                "content_1": "Ничего страшного! Я являюсь официальным партнёром одного из крупнейших провайдеров облачных услуг в России",
                "content_2": "С удовольствием помогу вам с подбором оптимальной конфигурации и вводом в эксплуатацию микросервисных решений.",
                "button": "Подробнее"
            }
        },
        "ux_reviews": {
            "heading": "UX оценка",
            "sub_heading": "для вашего бизнеса",
            "block_1": {
                "heading": "Что я предлагаю?",
                "content_1": "Я предлагаю сотрудничество в виде консультирования с целью улучшения качества пользовательского взаимодействия (UX) клиентов с вашим продуктом.",
                "content_2": "Оценка UX&nbsp;&mdash; это ключевой процесс в обеспечении соответствия вашего продукта к потребностям целевой аудитории. Являясь неотъемлемой частью разработки продукта любой сложности, такая оценка представляет собой всесторонний анализ взаимодействия пользователя с вашим продуктом (посадочной страницей, интернет-магазином, мобильным приложением и так далее).",
                "content_3": "В условиях современного рынка, где каждый продукт борется за внимание потребителя, верно спланированный UX может стать решающим фактором успеха."
            },
            "block_2": {
                "heading_1": "Успех продукта на рынке",
                "content_1": "Инвестиции в UX приводят к более высокому уровню удовлетворенности клиентов, повышению лояльности к конкретному бренду и бизнесу в целом. Компании, которые регулярно проводят оценку пользовательского взаимодействия и оптимизируют свои продукты с учетом полученных данных,&nbsp;&mdash; обеспечивают себе конкурентное преимущество на рынке.",
                "heading_2": "Увеличение конверсии и рост продаж",
                "content_2": "Оптимизация UX способствует более эффективному продвижению пользователей к поставленной цели, будь то покупка, регистрация или другое важное действие. Улучшенный пользовательский опыт может привести к увеличению конверсии, повышению продаж и росту доходов компании.",
                "heading_3": "Снижение стоимости поддержки",
                "content_3": "Хорошо спроектированный UX продукта уменьшает количество ошибок и проблем, с которыми сталкиваются ваши клиенты, что ведет к сокращению обращений в службу поддержки и, как следствие, к уменьшению расходов бизнеса."
            },
            "block_3": {
                "heading": "Пример UX оценки",
                "content": "Очень краткий пример реализованной мной ранее задачи, где UX оценка позволила увеличить конверсию для целевого действия на веб-сайте заказчика.",
                "tabs": {
                    "tab_1": {
                        "heading": "Проблема",
                        "content": "Страница регистрации на веб-сервисе заказчика показывает конверсию ниже ожидаемой: лишь 10% посетителей данного раздела проходят регистрацию и только половина из них подтверждают свой аккаунт, кликая на ссылку из транзакционного письма. Данное действие имеет важную роль в бизнес-процессах компании, т.к. основной функционал веб-сервиса становится доступным только после подтверждения аккаунта."
                    },
                    "tab_2": {
                        "heading": "Аналитика",
                        "content_1": "Так как страница регистрации является важной частью бизнес-процесса, при аналитике были учтены только те параметры, которые влияют на увеличение конверсии. А именно:",
                        "content_2": "Остальные параметры были специально исключены из аналитики, чтобы уменьшить их влияние на конечное решение.",
                        "list": {
                            "item_1": "Расположение страницы регистрации относительно главной страницы;",
                            "item_2": "Информация по заполнению полей формы и её процесс валидации;",
                            "item_3": "Кол-во провайдеров, с помощью которых возможна регистрация;",
                            "item_4": "Скорость отправки транзакционного письма и настройка почтового сервера;",
                            "item_5": "Релевантность информации в транзакционном письме."
                        }
                    },
                    "tab_3": {
                        "heading": "Решение",
                        "content_1": "В результате аналитических действий были выведены следующие решения для увеличения конверсии страницы регистрации на веб-сервисе заказчика:",
                        "content_2": "Отдельно стоит проработать и UI формы регистрации: необходимо исправить её внешний вид и последовательность полей, чтобы клиент мог максимально интуитивно заполнять эту форму.",
                        "list": {
                            "item_1": "Расположить форму регистрации на главной странице веб-сервиса (например, в стартовом блоке контента, где находится форма входа в аккаунт), чтобы клиенту не нужно было переходить на второстепенную страницу;",
                            "item_2": "Добавить справочную информацию по заполнению для каждого поля формы регистрации (например, в виде всплывающих подсказок по наведению на иконку вопроса);",
                            "item_3": "Добавить цветовую и текстовую индикацию на неверно введённые данные в форме регистрации (например, выделять красным поле сразу при вводе, а не после отправки на сервер по кнопке «Зарегистрироваться»);",
                            "item_4": "Добавить дополнительные провайдеры для регистрации на веб-сервисе, в дополнение к классической регистрации по эл. почте (например, с помощью аккаунта в Яндекс и VK). Так как фронтенд-часть веб-сервиса написана на React, для решения этой задачи можно использовать готовую библиотеку;",
                            "item_5": "Проверить настройки почтового сервера (DKIM и SPF), который отправляет транзакционные письма, т.к. очень часто они попадают в СПАМ-папку и клиент не может их посмотреть;",
                            "item_6": "В транзакционном письме отдельно выделить блок информации о преимуществах подтверждения аккаунта, сделать ссылку на подтверждение аккаунта более заметной."
                        }
                    }
                }
            },
            "block_4": {
                "heading": "Стоимость услуги",
                "content_1": "Оценка UX всегда уникальна и зависит от бизнес-процессов конкретной компании.",
                "content_2": "В таблице ниже приведены примерные сроки реализации и минимальный расчёт бюджета от которого вы можете отталкиваться. Более точные данные я смогу озвучить после ознакомления с техническим заданием или CJM.",
                "table": {
                    "heading_1": "Наименование услуги",
                    "heading_2": "Срок реализации",
                    "heading_3": "Стоимость",
                    "time_from": "от",
                    "work_days": "раб.&nbsp;дней",
                    "row_1": {
                        "column_1": "Оценка одного сценария в рамках вашего продукта"
                    },
                    "row_2": {
                        "column_1": "Комплексная оценка посадочной страницы (весь цикл пользовательского взаимодействия)"
                    },
                    "row_3": {
                        "column_1": "Комплексная оценка интернет-магазина или торговой онлайн-площадки (весь цикл пользовательского взаимодействия)"
                    },
                    "row_4": {
                        "column_1": "Комплексная оценка мобильного приложения для Android или iOS (весь цикл пользовательского взаимодействия)"
                    }
                }
            },
            "block_5": {
                "heading": "Что ещё входит в стоимость?",
                "content": "В стоимость услуги, кроме проведения анализа и составления оценки, всегда входят следующие работы:",
                "list": {
                    "item_1": "Подробный UX-отчёт с прогнозом по улучшению и техническими рекомендациями для отдела разработки (в формате Markdown или PDF).",
                    "item_2": "Вариант CJM на основании прогноза по улучшению (в формате FigJam).",
                    "item_3": "Консультации в течении 7 рабочих дней (в рамках изначального технического задания или CJM).",
                    "item_4": "Отправка пакета закрывающих документов для бухгалтерии."
                }
            },
            "block_6": {
                "heading": "Только думаете о переносе вашего бизнеса в онлайн?",
                "content_1": "Это отлично! Я являюсь официальным партнёром российской платформы по созданию веб-сайтов любой сложности",
                "content_2": "С радостью помогу вам выбрать шаблон с оптимальным UX под ваши задачи.",
                "button": "Подробнее"
            }
        },
        "service_provision": {
            "heading": "Информация",
            "sub_heading": "об оказании услуг",
            "block_1": {
                "heading": "Я работаю официально",
                "content": "Являясь официально зарегистрированным индивидуальным предпринимателем (ИП), я имею законное право осуществлять оказание аутсорсинговых услуг в сфере информационных технологий компаниям и частным лицам на территории Российской Федерации.",
                "business_name": "ИП Шостак Виктор Сергеевич",
                "ogrnip_name": "ОГРНИП",
                "inn_name": "ИНН"
            },
            "block_2": {
                "heading": "Работа с иностранными заказчиками в",
                "content_1": "В связи с невозможностью проведения оплаты моих работ по оказанию аутсорсинговых услуг в сфере информационных технологий иностранными компаниями или физическими лицами не имеющих официальных представительств или не являющимися налоговыми резидентами на территории Российской Федерации, я больше не могу сотрудничать с такими заказчиками.",
                "content_2": "Если вы являетесь иностранной компанией или физическим лицом и хотите получить более подробную информацию о возможности сотрудничества со мной, то напишите на электронную почту:",
                "content_3": "Приношу свои извинения за подобные ограничения! Надеюсь, что вскоре мир снова станет открытым."
            },
            "block_3": {
                "heading": "Документы",
                "content": "Список правовых документов, образцов договоров об оказании услуг компаниям и физическими лицами, платёжных реквизитов и прочих документов для ознакомления.",
                "table": {
                    "column_name_1": "№",
                    "column_name_2": "Название",
                    "column_name_3": "Язык",
                    "column_name_4": "Редакция от",
                    "column_name_5": "Ссылка на PDF"
                },
                "pdf_1": "Публичная оферта об оказании услуг",
                "pdf_2": "Образец Приложения №1 к Публичной оферте об оказании услуг",
                "pdf_3": "Образец Соглашения об электронном документообороте (ЭДО) между контрагентами",
                "pdf_4": "Платёжные реквизиты",
                "button": "Посмотреть"
            }
        }
    }
}