{
    "dir": "ltr",
    "components": {
        "back_to_home": "Back to home",
        "cookie_confirm": {
            "content": "Don't worry, I'm using cookies to offer you a better\nbrowsing experience. Like any other websites.",
            "button": "Okay, close!"
        },
        "theme_switcher": {
            "view_toast": "Switch color theme"
        },
        "partnership_banner": {
            "heading": "Want to hire me?",
            "content_1": "To reduce processing time, please write me a message.",
            "content_2": "In the message be sure to include: name & general description of the project, technical specification, link to CJM (if user interaction is required) and desired deadlines.",
            "content_3": "I work in the UTC+03:00 time zone. Your messages will be considered on working days, from 11:00 to 18:00.",
            "button_1": "Write to Telegram",
            "button_2": "Write to Email",
            "email_subject": "Hire"
        },
        "mobile_nav": {
            "open": "Menu",
            "close": "Close",
            "block_1": {
                "heading": "Effective assistance",
                "link_1": "Microservices",
                "link_2": "UX reviews"
            },
            "block_2": {
                "heading": "Contact me",
                "link_1": "Write to Telegram",
                "link_2": "Write to Email",
                "link_3": "Add on LinkedIn",
                "email_subject": "Hello"
            },
            "block_3": {
                "heading": "Social links",
                "link_1": "GitHub profile",
                "link_2": "Dribbble portfolio",
                "link_3": "Dev.to blog"
            },
            "block_4": {
                "heading": "Website options",
                "link_1": "Change color theme",
                "link_2": "Переключить на русский"
            }
        },
        "index": {
            "phone_mockup": {
                "name_you": "You",
                "name_you_short": "Y",
                "name_vic_shostak": "Vic Shóstak",
                "msg_you_1": "Hey, Vic! Can you help me?",
                "msg_vic_shostak_1": "Greetings! Sure.",
                "msg_you_2": "Perfect, I have got an awesome business idea...",
                "msg_vic_shostak_2": "I'll take the time to bring it to production. Send me the details to Telegram!",
                "button": "Send message"
            }
        }
    },
    "modals": {
        "close": "Close",
        "my_skills": {
            "block_1": {
                "heading": "My skills",
                "content": "In more than 13 years of successful work in the IT industry, my technology stack has changed many times, but my technical expertise has always remained at a high level."
            },
            "block_2": {
                "heading": "Backend",
                "used_frameworks": "The frameworks and libraries used:",
                "go_content": "my primary language for realizing projects of various complexity and functionality (from microservices to monoliths). It perfectly copes with a wide range of tasks for developing highly efficient backend services and has proved it many times.",
                "python_content": "my secondary language, e.g. for artificial intelligence (AI) projects or in cases where the customer is unable/willing to use Go.",
                "n8n_content": "I use this product to develop a serverless architecture and API-gateway approach, as well as to create Telegram bots."
            },
            "block_3": {
                "heading": "Databases",
                "postgres_content": "my primary database for storing data. Also, I use its built-in LISTEN/NOTIFY functionality and JSONB fields.",
                "redis_content": "my primary in-memory database for caching data and working with brokers (e.g. Asynq or RabbitMQ).",
                "sqlite_content": "my secondary database for simple projects and static websites where using PostgreSQL doesn't make sense."
            },
            "block_4": {
                "heading": "Frontend",
                "vue_content": "my primary web framework. I'm a long-time fan of it (since version 2.x), so I implement all SPA/MPA projects in Vue ecosystem (Typescript).",
                "tailwind_content": "my primary CSS framework for creating user interface. I often use it together with the daisyUI component library and Nuxt UI.",
                "htmx_content": "I always support such technologies and libraries because they allow every backend developer to become even more efficient and implement frontend logic without going outside the usual stack.",
                "static_generators_content": "my main engines for creating static websites and public documentation.",
                "bun_content": "I use this modern, incredibly fast and backwards-compatible Node.js JavaScript runtime.",
                "vite_content": "my primary tool for creating and optimizing builds of the frontend part of the project."
            },
            "block_5": {
                "heading": "UX/UI design",
                "figma_content": "my primary tool for UX prototyping and creating UI design for websites and mobile apps.",
                "figjam_content": "my primary tool for composing CJM for websites and mobile apps."
            },
            "block_6": {
                "heading": "Proxy, CI/CD and deploy tools",
                "proxy_content": "the main proxy/web servers that I work with.",
                "docker_content": "I place all my Go/Python projects in Docker images for later deployment to a remote server or cloud infrastructure as isolated containers.",
                "actions_runners_content": "to automate the process of deploying and code base verification/validation.",
                "goreleaser_content": "to automate the process of building a Go project for different architectures and OS, as well as, publishing to Homebrew and Docker Hub."
            }
        },
        "work_philosophy": {
            "block_1": {
                "heading": "Work philosophy",
                "content_1": "All of my projects have excellent documentation and clear code.",
                "content_2": "But, I believe it's important not to just write clean code and create a supported infrastructure or a beautiful UI, but to look for the root of the problem in the task at hand.",
                "content_3": "This approach to problem solving allows implementing complex software solutions that can be supported by any development team."
            },
            "block_2": {
                "heading": "Working process",
                "content": "Here's an example describing my approach to solving a task that will give you an understanding of my working process.",
                "schema": {
                    "content_1": "Task\nstatement",
                    "content_2": "Analysis of the\ntechnical task/CJM",
                    "content_3": "Working out\nan optimal solution",
                    "content_4": "Approval of the\nrealization plan",
                    "content_5": "Realization",
                    "content_6": "Test bench\npreparation",
                    "content_7": "Realization\ntesting",
                    "content_8": "Making edits",
                    "content_9": "Final testing",
                    "content_10": "Documentation\nfor realization",
                    "content_11": "Transfer\nto customer"
                },
                "scroll_to_right": "Scroll to the right"
            },
            "block_3": {
                "heading": "Support of the realized projects",
                "content_1": "I provide free support (within the original technical specification or CJM) for all realized projects within 14 working days after they are transferred to the customer.",
                "content_2": "A longer period is agreed upon after the expiration of the free support period on an individual basis."
            },
            "block_4": {
                "heading": "Consulting",
                "content_1": "I provide free consultation (as part of the original terms of reference or CJM) on all analytical UX reports created within 7 working days of delivery to the customer.",
                "content_2": "A longer period is agreed upon after the free consultation period has expired on an individual basis."
            }
        },
        "timeweb_cloud": {
            "heading": "What is Timeweb Cloud?",
            "content_1": "Timeweb Cloud is a cloud infrastructure for business and development with 15 years of experience and more than 165 thousand customers.",
            "content_2": "Key advantages:",
            "list": {
                "item_1": "The infrastructure is deployed in fault-tolerant TIER III level data centers in Russia and Europe.",
                "item_2": "The data centers have a fault tolerance rate of at least 99.99% and are PCI DSS, ISO and 152-ФЗ certified.",
                "item_3": "There are all the required cloud technologies to work with (databases, S3 storage, Kubernetes, CI/CD and so on).",
                "item_4": "Round-the-clock monitoring of service availability and instant response to emerging problems.",
                "item_5": "Support 24/7 within 1 minute on the phone and in 15 minutes in a ticket."
            },
            "from_author": {
                "name": "Vic Shóstak",
                "content": "From myself personally, I can highlight such advantages of Timeweb Cloud as affordable prices and maximum customer focus."
            },
            "button": "Go to Timeweb Cloud website"
        },
        "craftum_myreviews": {
            "heading": "What are Craftum & MyReviews?",
            "content_1": "Craftum is an online website builder for creating websites of any complexity with more than 150 ready-made templates of premium quality.",
            "content_2": "Key advantages:",
            "list_1": {
                "item_1": "Creating websites based on ready-made templates or your own design.",
                "item_2": "Help you migrate your website from Wix, Tilda, Squarespace and Ecwid.",
                "item_3": "Many ready integrations with other services (online chat, online payment acceptance systems, analytics, and so on).",
                "item_4": "Built-in tools for SEO-promotion.",
                "item_5": "Support 24/7."
            },
            "content_3": "MyReviews is a simple and powerful tool for handling reviews of your business or a specific service online.",
            "content_4": "Key advantages:",
            "list_2": {
                "item_1": "Automatic collection of statistics from sites (Google Maps, Yandex.Maps, 2GIS and so on).",
                "item_2": "Interception of negative reviews before they are published on the platforms.",
                "item_3": "An online widget to collect reviews on your website."
            },
            "from_author": {
                "name": "Vic Shóstak",
                "content": "From myself personally, I can highlight such advantages of Craftum and MyReviews platforms as affordable prices and ease of use."
            },
            "button_1": "Go to Craftum website",
            "button_2": "Go to MyReviews website"
        }
    },
    "pages": {
        "index": {
            "left_column": {
                "block_1": {
                    "hello": "Hello,",
                    "author": "I'm Vic Shóstak."
                },
                "block_2": {
                    "heading": "Who am I?",
                    "content": "Software Engineer with excellent UX/UI knowledge and 13+ years of practical experience in multiple technological areas.",
                    "button": "My skills"
                },
                "block_3": {
                    "heading": "Philosophy of my work",
                    "content": "First of all, I'm developer who know a lot about comfortable development and support large projects in the long run.",
                    "button": "Read more"
                }
            },
            "middle_column": {
                "block_1": {
                    "heading": "Effective assistance",
                    "content": "I'm ready to share my experience to solve your business objectives."
                },
                "block_2": {
                    "heading_1": "Microservices",
                    "link_1": "Microservices allow your business to accept more and more orders",
                    "heading_2": "UX reviews",
                    "link_2": "Every successful business has the most effective web or mobile apps"
                },
                "block_3": {
                    "heading": "My projects",
                    "content": "Another passion of mine is creating useful and Open Source tools for developers and businesses around the world."
                },
                "block_4": {
                    "content": "Yes, I'm always looking for new collaborators to create great products and services. If you have an idea for an open source project, get in touch with me!",
                    "button": "Write message",
                    "email_subject": "Collaborate"
                },
                "block_5": {
                    "content": "A next-generation CLI tool for build amazing web apps",
                    "view_gowebly": "View Gowebly website"
                },
                "block_6": {
                    "content": "A smart self-hosted tool for sharing secrets to your friends",
                    "view_secretium": "View Secretium website"
                },
                "block_7": {
                    "content": "A ready-made Go project with frontend & deploy automation",
                    "view_cgapp": "View Create Go App repository"
                }
            },
            "right_column": {
                "block_1": {
                    "view_github": "View my GitHub profile",
                    "view_dribbble": "View my Dribbble portfolio",
                    "view_dev_to": "View my Dev.to blog",
                    "view_linkedin": "View my LinkedIn profile"
                },
                "block_2": {
                    "heading": "Я говорю на русском",
                    "content": "Основные языки для текстового общения со мной&nbsp;&mdash; русский и английский.",
                    "button": "Переключить на русский"
                },
                "block_3": {
                    "author": "Vic Shóstak",
                    "content": "All rights reserved. Every illustrations & textual content are crafted by Vic Shóstak with&nbsp;&#10084; for people and robots.",
                    "link": "Information on service provision"
                }
            }
        },
        "microservices": {
            "heading": "Microservices",
            "sub_heading": "for your business",
            "block_1": {
                "heading": "What am I offering?",
                "content_1": "I offer full-service collaboration to build scalable, maintainable and fault-tolerant microservices for your business in Go or Python.",
                "content_2": "Microservices are atomic units, they are independent of your development team's chosen technology stack used in other parts of your business process.",
                "content_3": "Inter Program Communication (IPC) will utilize gRPC or REST (in JSON format), making it much easier to integrate the new service into your current infrastructure."
            },
            "block_2": {
                "heading_1": "Scalability and flexibility",
                "content_1": "Microservices offer a unique opportunity to start small and scale as you grow. Each service can be deployed independently, allowing you to increase resources for the most stressed parts of the system without affecting the rest.",
                "heading_2": "Accelerating the development process",
                "content_2": "Microservices can be developed and deployed autonomously, speeding up the process of making changes and updates. This makes them an ideal solution for any business that needs to constantly update their systems without downtime.",
                "heading_3": "Uninterrupted work",
                "content_3": "Microservice architecture increases the resilience of the system to failures: if one service fails, it does not affect the operation of the rest and vice versa."
            },
            "block_3": {
                "heading": "Examples of tasks",
                "content": "A list of some of my previously realized tasks, where the application of microservice architecture allowed to improve the customer's business metrics.",
                "flowchart": {
                    "action": "Action",
                    "client": "Client",
                    "microservice": "Microservice",
                    "api": "External API",
                    "db": "Database",
                    "payment": "Payment terminal",
                    "crm": "CRM system",
                    "bi": "BI analytics",
                    "report": "Report"
                },
                "card_1": {
                    "heading": "Processing incoming requests (API gateway)",
                    "content": "A service that integrates with various external/internal company systems, processes customer requests and returns the result in a set format."
                },
                "card_2": {
                    "heading": "Recommendation and notification system",
                    "content": "A system that sends personalized recommendations and event notifications to customers based on accumulated company data and other internal sales department metrics."
                },
                "card_3": {
                    "heading": "System for collecting statistics and analytics",
                    "content": "A system for collecting data on user interactions (on a website or mobile app) and analyzing them to produce business insights."
                }
            },
            "block_4": {
                "heading": "Cost of the service",
                "content_1": "A microservice solution is always unique to each business.",
                "content_2": "The table below shows approximate terms of realization and minimum budget calculation from which you can start. I will be able to give more precise data after familiarizing with the technical specification or CJM.",
                "table": {
                    "heading_1": "Name of the service",
                    "heading_2": "Realization period",
                    "heading_3": "Cost",
                    "time_from": "from",
                    "work_days": "working&nbsp;days",
                    "row_1": {
                        "column_1": "Single microservice function according to your requirements to solve tasks in your current infrastructure"
                    },
                    "row_2": {
                        "column_1": "Full cycle planning and development of a microservice backend system based on your requirements from zero"
                    }
                }
            },
            "block_5": {
                "heading": "What else is included?",
                "content": "In addition to the development of a microservice solution, the cost of the service always includes the following work:",
                "list": {
                    "item_1": "Preparing a test stand for cooperative realization testing.",
                    "item_2": "Preparing Docker containers for deployment to your infrastructure.",
                    "item_3": "Comprehensive instruction guide (in Markdown or PDF format).",
                    "item_4": "Consultation and support during 14 working days (within the original technical specification or CJM).",
                    "item_5": "Sending a package of closing documents to the accounting department."
                }
            },
            "block_6": {
                "heading": "No in-house infrastructure?",
                "content_1": "Nothing to worry about! I'm an official partner of one of the largest cloud service providers in Russia",
                "content_2": "I will be glad to help you with selection of optimal configuration and commissioning of microservice solutions.",
                "button": "Read more"
            }
        },
        "ux_reviews": {
            "heading": "UX reviews",
            "sub_heading": "for your business",
            "block_1": {
                "heading": "What am I offering?",
                "content_1": "I offer collaboration in the type of consulting to improve the quality of customer user experience (UX) with your product.",
                "content_2": "UX review is a key process in ensuring that your product meets the needs of your target audience. Being an integral part of product development of any complexity, this assessment is a comprehensive analysis of user interaction with your product (landing page, online store, mobile app, and so on).",
                "content_3": "In today's marketplace, where every product is fighting for the consumer's attention, a well-planned UX can be a critical success factor."
            },
            "block_2": {
                "heading_1": "Product success in the market",
                "content_1": "Investing in UX leads to higher levels of customer satisfaction, increased brand loyalty and business loyalty. Companies that regularly evaluate user interactions and optimize their products based on the findings provide a competitive advantage in the marketplace.",
                "heading_2": "Increase conversion and sales growth",
                "content_2": "UX optimization helps to better move users toward their goal, whether it's a purchase, registration, or other important action. An improved user experience can lead to increased conversions, higher sales and more revenue for a company.",
                "heading_3": "Reduced cost of support",
                "content_3": "A well-designed product UX reduces the number of errors and problems your customers encounter, leading to fewer support calls and, as a result, lower business costs."
            },
            "block_3": {
                "heading": "UX review example",
                "content": "A very brief example of a task I realized earlier, where a UX review increased the conversion rate for a targeted action on a customer's website.",
                "tabs": {
                    "tab_1": {
                        "heading": "Issue",
                        "content": "The registration page on the customer's web service shows a lower than expected conversion rate: only 10% of visitors to this section register, and only half of them confirm their account by clicking on the link from the transaction email. This action has an important role in the company's business processes, as the main functionality of the web service becomes available only after account confirmation."
                    },
                    "tab_2": {
                        "heading": "Analytics",
                        "content_1": "Since the registration page is an important part of the business process, the analytics took into account only those parameters that affect the increase in conversions. Namely:",
                        "content_2": "The remaining parameters were specifically excluded from the analytics to reduce their impact on the final solution.",
                        "list": {
                            "item_1": "The location of the registration page relative to the home page;",
                            "item_2": "Information on completing the form fields and its validation process;",
                            "item_3": "Number of providers through which registration is possible;",
                            "item_4": "Transactional email speed and mail server configuration;",
                            "item_5": "Relevance of information in transactional writing."
                        }
                    },
                    "tab_3": {
                        "heading": "Solution",
                        "content_1": "As a result of analytical actions, the following solutions were derived to increase the conversion rate of the registration page on the customer's web service:",
                        "content_2": "The UI of the registration form should be worked out separately: it is necessary to correct its appearance and the sequence of fields so that the client could fill out this form as intuitively as possible.",
                        "list": {
                            "item_1": "Place the registration form on the main page of the web service (for example, in the starting block of content where the account login form is located), so that the customer does not have to go to a secondary page;",
                            "item_2": "Add fill-in reference information for each field of the registration form (for example, in the form of tooltips when hovering over the question icon);",
                            "item_3": "Add color and text indication for incorrectly entered data in the registration form (e.g., highlight the field in red immediately upon entry, not after it is sent to the server by the «Register» button);",
                            "item_4": "Add additional providers for registration on the web service, in addition to the classic registration by email (e.g., using Yandex and VK account). Since the frontend part of the web service is written in React, you can use a ready-made library to solve this task;",
                            "item_5": "Check the settings of the mail server (DKIM and SPF) that sends transactional emails, because very often they end up in the SPAM folder and the client cannot view them;",
                            "item_6": "In the transactional email separately allocate a block of information about the benefits of account confirmation, make the link to account confirmation more prominent."
                        }
                    }
                }
            },
            "block_4": {
                "heading": "Cost of service",
                "content_1": "UX reviews are always unique and depend on the business processes of a particular company.",
                "content_2": "The table below shows approximate terms of realization and minimum budget calculation from which you can start. I will be able to give more precise data after familiarizing with the terms of reference or CJM.",
                "table": {
                    "heading_1": "Name of the service",
                    "heading_2": "Realization period",
                    "heading_3": "Cost",
                    "time_from": "from",
                    "work_days": "working&nbsp;days",
                    "row_1": {
                        "column_1": "Reviewing one scenario within your product"
                    },
                    "row_2": {
                        "column_1": "Comprehensive landing page review (the entire cycle of user interaction)"
                    },
                    "row_3": {
                        "column_1": "Comprehensive review of an online store or online trading platform (the entire cycle of user interaction)"
                    },
                    "row_4": {
                        "column_1": "Comprehensive review of a mobile application for Android or iOS (the entire cycle of user interaction)"
                    }
                }
            },
            "block_5": {
                "heading": "What else is included?",
                "content": "The following work is always included in the cost of the service, in addition to analyzing and compiling the estimate:",
                "list": {
                    "item_1": "A detailed UX report with improvement forecast and technical recommendations for the development department (in Markdown or PDF format).",
                    "item_2": "A variant of CJM based on the improvement forecast (in FigJam format).",
                    "item_3": "Consultation during 7 working days (as part of the original terms of reference or CJM).",
                    "item_4": "Sending a package of closing documents to the accounting department."
                }
            },
            "block_6": {
                "heading": "Just thinking of moving your business online?",
                "content_1": "This is great! I am an official partner of a Russian platform for creating websites of any complexity",
                "content_2": "I will gladly help you choose a template with optimal UX for your tasks, as well as customize the service to work with feedback",
                "button": "Read more"
            }
        },
        "service_provision": {
            "heading": "Information",
            "sub_heading": "on service provision",
            "block_1": {
                "heading": "I'm working officially",
                "content": "As an officially registered individual entrepreneur (IE), I have the legal right to provide outsourcing services in the area of IT to companies and private persons on the territory of the Russian Federation.",
                "business_name": "IE Shostak Victor Sergeevich",
                "ogrnip_name": "OGRNIP",
                "inn_name": "INN"
            },
            "block_2": {
                "heading": "Work with international customers in",
                "content_1": "Due to the impossibility of payment for my work on outsourcing services in the area of IT by international companies or private persons who do not have official representative offices or are not Russian tax residents, I can no longer collaborate with such customers.",
                "content_2": "If you are an international company or a private person and would like to get more information about the possibility of collaboration with me, please write to email:",
                "content_3": "I apologize for such limitations! I hope the world will be open again soon."
            },
            "block_3": {
                "heading": "Documents",
                "content": "List of legal documents, sample service contracts for companies and private persons, payment details and other documents for review.",
                "table": {
                    "column_name_1": "#",
                    "column_name_2": "Name",
                    "column_name_3": "Last update",
                    "column_name_4": "PDF link"
                },
                "pdf_oferta": "Public offer",
                "pdf_politics": "Privacy policy and personal data processing",
                "pdf_sample_contract_1": "Sample contract for the provision of outsourcing services in the area of IT on a fee-for-service basis",
                "pdf_payment": "Payment details",
                "button": "Download"
            }
        }
    }
}